{
  "produits": [
    {
      "id": 1,
      "marque": "Adidas",
      "designation": "Ultra 4dfw",
      "prixUnitaire": 230,
      "src1": "assets/images/adidasultra4dfwd.jpg",
      "src2": "assets/images/adidasultra4dfwd2.jpg",
      "src3": "assets/images/adidasultra4dfwd3.jpg",
      "quantite": 64,
      "detail": "Cloud White / Core Black / Solar Yellow. UNE CHAUSSURE DE RUNNING ASSURANT UNE FOULÉE SOUPLE, CONÇUE EN PARTIE À BASE DE PARLEY OCEAN PLASTIC. Courir, c'est aller de l'avant à chaque foulée, à chaque kilomètre, chaque jour que tu t'entraînes. Que ta foulée soit rapide ou lente, longue ou courte, cette chaussure adidas est conçue pour te guider dans la bonne direction. Le maillage oblique sur la semelle intermédiaire offre maintien et amorti pour te propulser vers l'avant à chaque pas. Le résultat ? Une foulée fluide qui ressemble plus à un glissement qu'à une série d'impacts sur le bitume. La tige adidas Primeknit épouse les contours du pied, tandis que la semelle extérieure en caoutchouc adhérent assure une accroche supérieure sur les surfaces sèches et mouillées. La tige de cette chaussure est confectionnée avec une fibre haute performance contenant 50 % minimum de Parley Ocean Plastic, une matière créée à partir de déchets plastiques recyclés qui ont été collectés sur les îles, les plages et le littoral, pour éviter la pollution des océans. Les 50 % restants sont constitués de polyester recyclé.",
      "categorieProduit": "chaussures",
      "cible": "femme",
      "like": 7
    },
    {
      "id": 2,
      "marque": "Nike",
      "designation": "Air Zoom Tempo",
      "prixUnitaire": 199.99,
      "src1": "assets/images/nikeairzoom.jpg",
      "src2": "assets/images/nikeairzoom2.jpg",
      "src3": "assets/images/nikeairzoom3.jpg",
      "quantite": 17,
      "detail": "UNE CHAUSSURE RÉSISTANTE, CONÇUE POUR BATTRE DES RECORDS. Ces petits bolides passeraient l'épreuve haut la main un jour de course, mais ils peuvent aussi servir de chaussure d'entraînement au quotidien. Le maintien efficace et l'amorti souple s'associent pour vous offrir le confort qui vous fera tenir la distance sur des runs longs, et la légèreté qui vous permettra d'accélérer la cadence le moment venu. Sensation de réactivité. La mousse Nike ZoomX, intégrée à la semelle intérieure, offre un retour d'énergie exceptionnel. L'unité Zoom Air visible assure quant à elle un amorti performant qui vous fera gagner en dynamisme à chaque foulée. La technologie Nike React est composée d'une mousse légère et résistante qui garantit une foulée fluide et dynamique. Adhérence conçue pour les runners. Créé à partir des données de centaines de runners, le motif d'adhérence est placé aux endroits stratégiques pour vous offrir une adhérence optimale sur de nombreuses surfaces. Coupe dynamique. L'empeigne Flyknit translucide offre une bonne respirabilité là où votre pied a tendance à chauffer. Elle utilise des fibres solides et extensibles pour créer une sensation de légèreté tout en vous assurant un maintien optimal à chaque kilomètre. Plus d'avantages. Laçage asymétrique pour un maintien optimal et fiable. Semelle de propreté amovible semi-adhésive pour la remplacer facilement. Renforts rembourrés au talon. Boucle au talon. Semelle extérieure en caoutchouc. Couleur affichée : Volt électrique/Mousse menthe/Vert pâle/Violet d'évêque.",
      "categorieProduit": "chaussures",
      "cible": "homme",
      "like": 240
    },
    {
      "id": 3,
      "marque": "Reebok",
      "designation": "Débardeur running Speedwick",
      "prixUnitaire": 25,
      "src1": "assets/images/reebokdebardeur.jpg",
      "src2": "assets/images/reebokdebardeur2.jpg",
      "src3": "assets/images/reebokdebardeur3.jpg",
      "quantite": 17,
      "detail": "UN DÉBARDEUR DE RUNNING ISSU DE LA COLLECTION [REE]CYCLED DE REEBOK. Le running fait partie de ta vie. Avec ce débardeur pour homme, tu restes au sec quand le rythme s'accélère. Sa technologie Speedwick évacue la transpiration et les empiècements en mesh offrent aération et fraîcheur. Les détails réfléchissants permettent une bonne visibilité par faible luminosité. Semi Orange Flare",
      "categorieProduit": "vêtements",
      "cible": "homme",
      "like": 0
    },
    {
      "id": 4,
      "marque": "Garmin",
      "designation": "Forerunner 255",
      "prixUnitaire": 349.99,
      "src1": "assets/images/garminforerunner.jpg",
      "src2": "assets/images/garminforerunner2.jpg",
      "src3": "assets/images/garminforerunner3.jpg",
      "quantite": 17,
      "detail": "PROGRESSEZ ET PASSEZ À LA VITESSE SUPÉRIEURE. Foulée après foulée, vous faites des progrès. Passons maintenant à l'étape suivante. Obtenez les informations d'entraînement et de récupération dont vous avez besoin pour atteindre votre meilleur temps à ce jour. Obtenez un aperçu de votre sommeil, de votre statut VFC et de votre entraînement quotidien dans un rapport matinal. Chargez moins et entraînez-vous davantage avec une autonomie pouvant aller jusqu'à 14 jours en mode montre connectée et jusqu'à 30 heures en mode GPS. Repoussez vos limites avec la fonction de triathlon intégrée et plus de 30 profils d'activité. Planifiez votre stratégie avec les suggestions d'entraînements quotidiennes, des détails sur les parcours et bien plus encore avec le widget Course. Utilisez une suite complète de métriques et d'outils d'entraînement avancés pour atteindre vos objectifs. CONÇUE POUR DE LONGUES COURSES. Obtenez une image ininterrompue de votre état de santé et de votre sommeil nocturne avec une autonomie allant jusqu'à 14 jours en mode montre connectée et jusqu'à 30 heures en mode GPS. (PRESQUE) AUSSI LÉGÈRE QU'UNE PLUME. Avec son design élégant et son poids de 49 g, vous oublierez presque que vous portez votre Forerunner® 255, même lorsque vous dormez. MATÉRIAUX RÉSISTANTS À LA TRANSPIRATION. Dotée de boutons faciles à utiliser et d'un bracelet en silicone, cette montre est prête à être portée et reportée grâce à son verre Corning® Gorilla® Glass 3 durable. Bleu",
      "categorieProduit": "objets connectés",
      "cible": "mixte",
      "like": 33
    },
    {
      "id": 5,
      "marque": "Adidas",
      "designation": "Chaussure de trail running Terrex Agravic Pro",
      "prixUnitaire": 200,
      "src1": "assets/images/adidasterrex.jpg",
      "src2": "assets/images/adidasterrex2.jpg",
      "src3": "assets/images/adidasterrex3.jpg",
      "quantite": 17,
      "detail": "Core Black / Cloud White / Turbo. UNE CHAUSSURE DE TRAIL RUNNING TECHNIQUE, CONÇUE EN PARTIE AVEC PARLEY OCEAN PLASTIC. Plus le terrain est rocailleux et accidenté, plus tu as besoin de cette chaussure de trail running adidas. Elle offre une protection à 360 degrés contre les éraflures et les débris grâce à sa plaque de protection sur toute la longueur de la semelle intermédiaire et son col montant résistant à l'abrasion. Repousse tes limites en toute liberté grâce à l'amorti LIGHSTRIKE qui absorbe les impacts sur les runs longue distance. Cette chaussure possède une semelle extérieure en caoutchouc Continental™ pour une accroche exceptionnelle. Chausson intégré. Système de fermeture micro-ajustable. Tige textile résistante à l'abrasion. Design confortable. Plaque de protection au niveau de la semelle intermédiaire. Amorti Lightstrike. Semelle extérieure en caoutchouc Continental™. La tige contient au moins 50 % de Parley Ocean Plastic et 50 % de polyester recyclé.",
      "categorieProduit": "chaussures",
      "cible": "homme",
      "like": 27
    },
    {
      "id": 6,
      "marque": "Adidas by Stella McCartney",
      "designation": "Veste en toile Truepace",
      "prixUnitaire": 160,
      "src1": "assets/images/vestestella.jpg",
      "src2": "assets/images/vestestella2.jpg",
      "src3": "assets/images/vestestella3.jpg",
      "quantite": 17,
      "detail": "UN COUPE-VENT LÉGER ET REPLIABLE AU STYLE FÉMININ. Enchaîne les kilomètres tout en élégance malgré les rafales avec ce coupe-vent adidas by Stella McCartney. Entièrement confectionnée en polyester recyclé, cette veste légère est équipée de la technologie WIND.RDY pour te protéger du mauvais temps, sans t'alourdir. L'insert en mesh et l'empiècement ouvert au dos de cette veste ajoutent des détails stylés et permettent à l'air de circuler. Si le soleil finit par apparaître, tu peux la replier dans la poche arrière pour la transporter facilement. Ce coupe-vent est doté d'éléments réfléchissants pour t'assurer une meilleure visibilité lorsque tu cours avant ta journée de travail. Porte-le avec le pantalon de running TruePace pour rester au sec de la tête aux pieds. Coupe ample. Zip sur toute la longueur. Col montant. Tissu façonné 100 % polyester recyclé. Design léger. Poches zippées. Panneau arrière en mesh aéré. Base réglable avec un cordon élastique. Se replie dans une poche. Couleur du produit : Shock Yellow",
      "categorieProduit": "vêtements",
      "cible": "femme",
      "like": 7
    },
    {
      "id": 7,
      "marque": "Reebok",
      "designation": "Floatride Energy X",
      "prixUnitaire": 170,
      "src1": "assets/images/reebokfloatride.jpg",
      "src2": "assets/images/reebokfloatride2.jpg",
      "src3": "assets/images/reebokfloatride3.jpg",
      "quantite": 17,
      "detail": "UNE CHAUSSURE DE RUNNING PERFORMANTE ISSUE DE LA COLLECTION [REE]CYCLED DE REEBOK. Inspirée des athlètes du Reebok Boston Track Club, cette chaussure de running est conçue pour les marathons et les entraînements longue distance. La tige Flexweave® est résistante, respirante et offre un soutien ciblé. Le laçage asymétrique assure un chaussant ajusté. La mousse légère Floatride Energy présente une forme en rouleau pour une foulée plus fluide. Une plaque de carbone à l'avant-pied améliore la propulsion et l'efficacité. Orange Flare / Infused Lilac / Acid Yellow. Conçue À Partir De Matières Recyclées. Elle est fabriquée avec au moins 30 % de matériaux recyclés ou transformés. Tissu Stretch Et Maintien. La tige textile Flexweave® extensible et résistante apporte un maintien ciblé aux zones clés. Plus D'énergie. La mousse Floatride Energy procure un amorti léger et réactif.",
      "categorieProduit": "chaussures",
      "cible": "femme",
      "like": 24
    },
    {
      "id": 8,
      "marque": "Apple",
      "designation": "Apple Watch Nike Series 7 (GPS) avec Bracelet Sport Nike",
      "prixUnitaire": 429,
      "src1": "assets/images/applewatch.jpg",
      "src2": "assets/images/applewatch2.jpg",
      "src3": "assets/images/applewatch3.jpg",
      "quantite": 7,
      "detail": "Conçu pour bouger. Avec l'Apple Watch Nike Series 7 et son application Nike Run Club intégrée, vous pouvez suivre vos entraînements et écouter des runs guidés. Écoutez votre musique préférée à partir de votre montre pour booster votre motivation. Activez le mode crépuscule Nike pour une meilleure visibilité. Faites votre choix parmi des bracelets et cadrans Nike exclusifs. Avantages: L'écran Retina toujours activé est 20 % plus grand que celui de la Series 6, pour plus de visibilité et une grande facilité d'utilisation. Il est 70 % plus lumineux en intérieur lorsque vous avez le poignet baissé. L'écran en cristal est le plus résistant aux fissures de toutes les Apple Watch, avec une barrière anti-poussière IP6X et une conception résistante à l'eau. Mesurez votre taux d'oxygène dans le sang grâce à un capteur et à une application révolutionnaires. Passez un électro­cardio­gramme à tout moment. Recevez des notifications si vous présentez des signes d'arythmie, ou si votre fréquence cardiaque est anormalement faible ou élevée. Restez zen avec l'application Pleine conscience et suivez l'évolution de vos rythmes de sommeil avec l'application Sommeil. Découvrez les nouveaux entraînements de Tai Chi et de Pilates, en plus des incontournables tels que le running, le yoga, la natation et la danse. Suivez vos activités quotidiennes sur Apple Watch et dans l'application Fitness sur iPhone. En avant la musique. Et les podcasts. Et les livres audio. Faites vos achats instantanément et en toute sécurité grâce à Apple Pay à votre poignet. Autonomie tout au long de la journée et chargement accéléré. watchOS 8 présente de nouveaux types d’entraînement, l’app Pleine conscience, les nouveaux cadrans Portraits et des améliorations apportées à Messages",
      "categorieProduit": "objets connectés",
      "cible": "mixte",
      "like": 2
    }
  ],
  "utilisateurs": [
    {
      "id": 1,
      "nom": "Legrand",
      "prenom": "Celestine",
      "motDePasse": "celestine",
      "adresse": "15 rue Ernest, 69000 Lyon",
      "email": "celestine.l69@gmail.com"
    },
    {
      "id": 2,
      "nom": "Ravo",
      "prenom": "Pierre",
      "motDePasse": "pierre",
      "adresse": "13 avenue du Puit neuf, 75012 Paris",
      "email": "pierre.r75@gmail.com"
    },
    {
      "id": 3,
      "nom": "Caron",
      "prenom": "Peche",
      "motDePasse": "peche",
      "adresse": "12 chemin des Cerises, 13012 Marseille",
      "email": "peche.c13@gmail.com"
    },
    {
      "prenom": "Fabien",
      "nom": "Chartier",
      "email": "fabien.c06@gmail.com",
      "motDePasse": "fabien",
      "adresse": "18 chemin de la plage, 06130 Grasse",
      "id": 4
    },
    {
      "prenom": "Cecile",
      "nom": "Heuillet",
      "email": "cecile.h06@gmail.com",
      "motDePasse": "cecile",
      "adresse": "18 chemin de la plage, 06130 Grasse",
      "id": 5
    }
  ],
  "commandes": [
    {
      "noCommande": 1,
      "idUtilisateur": 4
    }
  ],
  "detailsCommande": [
    {
      "noCommande": 1,
      "idProduit": 1,
      "quantite": 1
    },
    {
      "noCommande": 1,
      "idProduit": 5,
      "quantite": 1
    },
    {
      "noCommande": 1,
      "idProduit": 7,
      "quantite": 1
    }
  ]
}